CSI API ETABS v1
eLoadPatternType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eLoadPatternType
Public Enumeration eLoadPatternType
Dim instance As eLoadPatternType
public enum class eLoadPatternType
type eLoadPatternType
Members
Member name | Value | Description
Dead | 1
SuperDead | 2
Live | 3
ReduceLive | 4
Quake | 5
Wind | 6
Snow | 7
Other | 8
Move | 9 |  Not valid for ETABS and SAFE
Temperature | 10
Rooflive | 11
Notional | 12
PatternLive | 13
Wave | 14 |  Not valid for ETABS and SAFE
Braking | 15 |  Not valid for ETABS and SAFE
Centrifugal | 16 |  Not valid for ETABS and SAFE
Friction | 17 |  Not valid for ETABS and SAFE
Ice | 18 |  Not valid for ETABS and SAFE
WindOnLiveLoad | 19 |  Not valid for ETABS and SAFE
HorizontalEarthPressure | 20 |  Not valid for ETABS and SAFE
VerticalEarthPressure | 21 |  Not valid for ETABS and SAFE
EarthSurcharge | 22 |  Not valid for ETABS and SAFE
DownDrag | 23 |  Not valid for ETABS and SAFE
VehicleCollision | 24 |  Not valid for ETABS and SAFE
VesselCollision | 25 |  Not valid for ETABS and SAFE
TemperatureGradient | 26 |  Not valid for ETABS and SAFE
Settlement | 27 |  Not valid for ETABS and SAFE
Shrinkage | 28 |  Not valid for ETABS and SAFE
Creep | 29 |  Not valid for ETABS and SAFE
WaterloadPressure | 30 |  Not valid for ETABS and SAFE
LiveLoadSurcharge | 31 |  Not valid for ETABS and SAFE
LockedInForces | 32 |  Not valid for ETABS and SAFE
PedestrianLL | 33 |  Not valid for ETABS and SAFE
Prestress | 34
Hyperstatic | 35 |  Not valid for ETABS and SAFE
Bouyancy | 36 |  Not valid for ETABS and SAFE
StreamFlow | 37 |  Not valid for ETABS and SAFE
Impact | 38 |  Not valid for ETABS and SAFE
Construction | 39
DeadWearing | 40 |  Not valid for ETABS and SAFE
DeadWater | 41 |  Not valid for ETABS and SAFE
DeadManufacture | 42 |  Not valid for ETABS and SAFE
EarthHydrostatic | 43 |  Not valid for ETABS and SAFE
PassiveEarthPressure | 44 |  Not valid for ETABS and SAFE
ActiveEarthPressure | 45 |  Not valid for ETABS and SAFE
PedestrianLLReduced | 46 |  Not valid for ETABS and SAFE
SnowHighAltitude | 47 |  Not valid for ETABS and SAFE
EuroLm1Char | 48 |  Not valid for ETABS and SAFE
EuroLm1Freq | 49 |  Not valid for ETABS and SAFE
EuroLm2 | 50 |  Not valid for ETABS and SAFE
EuroLm3 | 51 |  Not valid for ETABS and SAFE
EuroLm4 | 52 |  Not valid for ETABS and SAFE
SeaState | 53 |  Not valid for ETABS and SAFE
Permit | 54 |  Not valid for ETABS and SAFE
MoveFatigue | 55 |  Not valid for ETABS and SAFE
MoveFatiguePermit | 56 |  Not valid for ETABS and SAFE
MoveDeflection | 57 |  Not valid for ETABS and SAFE
MoveTrain | 58 |  Not valid for ETABS and SAFE
PrestressTransfer | 59
PatternAuto | 60
QuakeDrift | 61
QuakeVerticalOnly | 62 |  Not valid for ETABS and SAFE
See Also
Reference
ETABSv1 Namespace